# Lab SQL 9
In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

## Create a table `rentals_may` to store the data from rental table with information for the month of May.

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # to get the password without showing the input
password = getpass.getpass()

 ···············

In [2]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

--> the following approach is not working: 

I am not sure if I understand the question correctly. Should this table be created via Python in our database or should it only be created for Python?

In [8]:
query_rental_m = '''CREATE TABLE rentals_may(
                rental_id INT UNIQUE NOT NULL,
                rental_date DATETIME NOT NULL,
                inventory_id MEDIUMINT UNSIGNED NOT NULL,
                customer_id SMALLINT UNSIGNED NOT NULL,
                return_date DATETIME DEFAULT NULL,
                staff_id TINYINT UNSIGNED NOT NULL,
                last_update DATETIME DEFAULT NULL,
                CONSTRAINT PRIMARY KEY (rental_id)
                ) 
                '''

In [ ]:
! pip install cryptography

In [9]:
#engine.execute("DROP TABLE IF EXISTS rentals_may", engine)
rentals_may = engine.execute(query_rental_m, engine)

TypeError: not all arguments converted during string formatting

In [ ]:
query_may = '''
            INSERT INTO rentals_may 
            SELECT * 
            FROM rental 
            WHERE MONTH(rental_date) = 05
            '''

engine.execute(query_may, engine)
rentals_may

## Insert values in the table `rentals_may` using the table rental, filtering values only for the month of May.

In [12]:
# creating Pandas dataframe with only values from month may
rentals_may = pd.read_sql_query("SELECT * FROM rental WHERE MONTH(rental_date) = 05", engine)
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## Create a table `rentals_june` to store the data from rental table with information for the month of June.

In [10]:
query_rentals_j = '''
                    CREATE TABLE rentals_june(
                    rental_id INT UNIQUE NOT NULL, 
                    rental_date DATETIME DEFAULT NULL,
                    inventory_id MEDIUMINT UNSIGNED DEFAULT NULL,
                    customer_id SMALLINT UNSIGNED DEFAULT NULL,
                    return_date DATETIME DEFAULT NULL,
                    staff_id TINYINT UNSIGNED DEFAULT NULL,
                    last_update TIMESTAMP DEFAULT NULL,
                    CONSTRAINT PRIMARY KEY (rental_id)
                    )'''

rentals_june = pd.read_sql_query(query_rentals_j, engine)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [11]:
query_june = '''INSERT INTO rentals_june 
            SELECT * 
            FROM rental 
            WHERE MONTH(rental_date) = 06;
            '''

rentals_june = engine.execute(query_june, engine)
rentals_june

TypeError: not all arguments converted during string formatting

## Insert values in the table `rentals_june` using the table rental, filtering values only for the month of June.

In [13]:
# creating Pandas dataframe with only values from month june
rentals_june = pd.read_sql_query("SELECT * FROM rental WHERE MONTH(rental_date) = 06", engine)
rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

## Check the number of rentals for each customer for May.

In [14]:
# writing SQL query to check number of rentals for each customer for may
nbr_rentals_cmr_may = '''
                        SELECT r.customer_id, c.first_name, c.last_name, COUNT(r.customer_id) AS nbr_rentals
                        FROM rental r
                        JOIN customer c
                        USING (customer_id)
                        WHERE MONTH(r.rental_date) = 05
                        GROUP BY r.customer_id
                        '''

#showing results in a Pandas dataframe
pd.read_sql_query(nbr_rentals_cmr_may, engine)

     customer_id first_name  last_name  nbr_rentals
0              1       MARY      SMITH            2
1              2   PATRICIA    JOHNSON            1
2              3      LINDA   WILLIAMS            2
3              5  ELIZABETH      BROWN            3
4              6   JENNIFER      DAVIS            3
..           ...        ...        ...          ...
515          594    EDUARDO      HIATT            4
516          595   TERRENCE  GUNDERSON            1
517          596    ENRIQUE   FORSYTHE            6
518          597    FREDDIE     DUGGAN            2
519          599     AUSTIN    CINTRON            1

[520 rows x 4 columns]

## Check the number of rentals for each customer for June.

In [15]:
# writing SQL query to check number of rentals for each customer for june
nbr_rentals_cmr_june = '''
                        SELECT r.customer_id, c.first_name, c.last_name, COUNT(r.customer_id) AS nbr_rentals
                        FROM rental r
                        JOIN customer c
                        USING (customer_id)
                        WHERE MONTH(r.rental_date) = 06
                        GROUP BY r.customer_id
                        '''

#showing results in a Pandas dataframe
pd.read_sql_query(nbr_rentals_cmr_june, engine)

     customer_id first_name  last_name  nbr_rentals
0              1       MARY      SMITH            7
1              2   PATRICIA    JOHNSON            1
2              3      LINDA   WILLIAMS            4
3              4    BARBARA      JONES            6
4              5  ELIZABETH      BROWN            5
..           ...        ...        ...          ...
585          595   TERRENCE  GUNDERSON            2
586          596    ENRIQUE   FORSYTHE            2
587          597    FREDDIE     DUGGAN            3
588          598       WADE   DELVALLE            1
589          599     AUSTIN    CINTRON            4

[590 rows x 4 columns]

## Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

  - Check the number of rentals for each customer for May
  - Check the number of rentals for each customer for June

    **Hint**: You can store the results from the two queries in two separate dataframes.

In [16]:
# storing queries in Pandas dataframes 
cmr_data_may = pd.read_sql_query(nbr_rentals_cmr_may, engine)
cmr_data_june = pd.read_sql_query(nbr_rentals_cmr_june, engine)

## Write a function that checks if customer borrowed more or less films in the month of June as compared to May.
 
 **Hint**: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the [merge function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html).

In [17]:
#merging both data frames

data_comb = cmr_data_may.merge(cmr_data_june, how='outer', on='customer_id', suffixes=('_may', '_june'))
data_comb

,customer_id,first_name_may,last_name_may,nbr_rentals_may,first_name_june,last_name_june,nbr_rentals_june
0,1,MARY,SMITH,2.0,MARY,SMITH,7.0
1,2,PATRICIA,JOHNSON,1.0,PATRICIA,JOHNSON,1.0
2,3,LINDA,WILLIAMS,2.0,LINDA,WILLIAMS,4.0
3,5,ELIZABETH,BROWN,3.0,ELIZABETH,BROWN,5.0
4,6,JENNIFER,DAVIS,3.0,JENNIFER,DAVIS,4.0
...,...,...,...,...,...,...,...
593,583,NaN,NaN,NaN,MARSHALL,THORN,6.0
594,585,NaN,NaN,NaN,PERRY,SWAFFORD,4.0
595,591,NaN,NaN,NaN,KENT,ARSENAULT,3.0
596,592,NaN,NaN,NaN,TERRANCE,ROUSH,5.0
597,598,NaN,NaN,NaN,WADE,DELVALLE,1.0

In [18]:
data_comb.isna().sum()

customer_id          0
first_name_may      78
last_name_may       78
nbr_rentals_may     78
first_name_june      8
last_name_june       8
nbr_rentals_june     8
dtype: int64

In [19]:
#filling NaN values for number of rentals with 0 --> as NaN means there were no rentals that month
data_comb['nbr_rentals_may'] = data_comb['nbr_rentals_may'].fillna(0)
data_comb['nbr_rentals_june'] = data_comb['nbr_rentals_june'].fillna(0)

data_comb.isna().sum()

customer_id          0
first_name_may      78
last_name_may       78
nbr_rentals_may      0
first_name_june      8
last_name_june       8
nbr_rentals_june     0
dtype: int64

In [20]:
#new column which tells us in which month there were more rentals

def more_rentals(x):
    if x['nbr_rentals_may'] > x['nbr_rentals_june']: 
        return 'may' 
    elif x['nbr_rentals_may'] < x['nbr_rentals_june']: 
        return 'june' 
    else: 
        return 'same' 


data_comb['more_rentals_in'] = data_comb.apply(more_rentals, axis=1)

data_comb

,customer_id,first_name_may,last_name_may,nbr_rentals_may,first_name_june,last_name_june,nbr_rentals_june,more_rentals_in
0,1,MARY,SMITH,2.0,MARY,SMITH,7.0,june
1,2,PATRICIA,JOHNSON,1.0,PATRICIA,JOHNSON,1.0,same
2,3,LINDA,WILLIAMS,2.0,LINDA,WILLIAMS,4.0,june
3,5,ELIZABETH,BROWN,3.0,ELIZABETH,BROWN,5.0,june
4,6,JENNIFER,DAVIS,3.0,JENNIFER,DAVIS,4.0,june
...,...,...,...,...,...,...,...,...
593,583,NaN,NaN,0.0,MARSHALL,THORN,6.0,june
594,585,NaN,NaN,0.0,PERRY,SWAFFORD,4.0,june
595,591,NaN,NaN,0.0,KENT,ARSENAULT,3.0,june
596,592,NaN,NaN,0.0,TERRANCE,ROUSH,5.0,june
597,598,NaN,NaN,0.0,WADE,DELVALLE,1.0,june